espressif/esp-idf/components/soc/esp32s31/include/soc/clk_tree_defs.h
//////////////////////////////////////////////////SDMMC///////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of SDMMC
 */
#define SOC_SDMMC_CLKS {SOC_MOD_CLK_MPLL}

/**
 * @brief Type of SDMMC clock source
 */
typedef enum {
    SDMMC_CLK_SRC_DEFAULT = SOC_MOD_CLK_MPLL,   /*!< Select MPLL as the default choice */
    SDMMC_CLK_SRC_MPLL = SOC_MOD_CLK_MPLL,      /*!< Select MPLL as the source clock */
} soc_periph_sdmmc_clk_src_t;

/////////////////////////////////////////////////SPI////////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of SPI
 */
#define SOC_SPI_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST, SOC_MOD_CLK_BBPLL}

/**
 * @brief Type of SPI clock source.
 */
typedef enum {
    SPI_CLK_SRC_XTAL     = SOC_MOD_CLK_XTAL,        /*!< Select XTAL as SPI source clock */
    SPI_CLK_SRC_RC_FAST  = SOC_MOD_CLK_RC_FAST,     /*!< Select RC_FAST_20M as SPI source clock */
    SPI_CLK_SRC_BBPLL    = SOC_MOD_CLK_BBPLL,       /*!< Select BBPLL as SPI source clock */
    SPI_CLK_SRC_DEFAULT  = SOC_MOD_CLK_BBPLL,       /*!< Select BBPLL as default source clock */
} soc_periph_spi_clk_src_t;

/////////////////////////////////////////////////PSRAM////////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of PSRAM
 */
#define SOC_PSRAM_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_CPLL, SOC_MOD_CLK_MPLL}

/**
 * @brief Type of PSRAM clock source.
 */
typedef enum {
    PSRAM_CLK_SRC_DEFAULT = SOC_MOD_CLK_MPLL,         /*!< Select SOC_MOD_CLK_MPLL as PSRAM source clock */
    PSRAM_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,            /*!< Select SOC_MOD_CLK_XTAL as PSRAM source clock */
    PSRAM_CLK_SRC_CPLL = SOC_MOD_CLK_CPLL,            /*!< Select SOC_MOD_CLK_CPLL as PSRAM source clock */
    PSRAM_CLK_SRC_MPLL = SOC_MOD_CLK_MPLL,            /*!< Select SOC_MOD_CLK_MPLL as PSRAM source clock */
} soc_periph_psram_clk_src_t;

/////////////////////////////////////////////////FLASH////////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of FLASH
 */
#define SOC_FLASH_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_CPLL, SOC_MOD_CLK_BBPLL}

/**
 * @brief Type of FLASH clock source.
 */
typedef enum {
    FLASH_CLK_SRC_DEFAULT = SOC_MOD_CLK_CPLL,         /*!< Select SOC_MOD_CLK_CPLL as FLASH source clock */
    FLASH_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,            /*!< Select SOC_MOD_CLK_XTAL as FLASH source clock */
    FLASH_CLK_SRC_CPLL = SOC_MOD_CLK_CPLL,            /*!< Select SOC_MOD_CLK_CPLL as FLASH source clock */
    FLASH_CLK_SRC_BBPLL = SOC_MOD_CLK_BBPLL,          /*!< Select SOC_MOD_CLK_BBPLL as FLASH source clock */
} soc_periph_flash_clk_src_t;

//////////////////////////////////////////////////MWDT/////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of MWDT
 */
#define SOC_MWDT_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_REF_F80M, SOC_MOD_CLK_RC_FAST}

/**
 * @brief MWDT clock source
 */
typedef enum {
    MWDT_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,           /*!< Select XTAL as the source clock */
    MWDT_CLK_SRC_REF_F80M = SOC_MOD_CLK_REF_F80M,   /*!< Select PLL fixed 80 MHz as the source clock */
    MWDT_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,     /*!< Select RTC fast as the source clock */
    MWDT_CLK_SRC_DEFAULT = SOC_MOD_CLK_XTAL,        /*!< Select XTAL 40 MHz as the default clock choice */
} soc_periph_mwdt_clk_src_t;

//////////////////////////////////////////////////SDM/////////////////////////////////////////////////////////////////

/**
 * @brief Sigma Delta Modulator clock source
 */
typedef enum {
    SDM_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,         /*!< Select XTAL clock as the source clock */
    SDM_CLK_SRC_REF_F80M = SOC_MOD_CLK_REF_F80M, /*!< Select REF_F80M clock as the source clock */
    SDM_CLK_SRC_DEFAULT = SOC_MOD_CLK_REF_F80M,  /*!< Select REF_F80M clock as the default clock choice */
} soc_periph_sdm_clk_src_t;

//////////////////////////////////////////////////GPIO Glitch Filter////////////////////////////////////////////////////

/**
 * @brief Glitch filter clock source
 */

typedef enum {
    GLITCH_FILTER_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,         /*!< Select XTAL clock as the source clock */
    GLITCH_FILTER_CLK_SRC_REF_F80M = SOC_MOD_CLK_REF_F80M, /*!< Select REF_F80M clock as the source clock */
    GLITCH_FILTER_CLK_SRC_DEFAULT = SOC_MOD_CLK_REF_F80M,  /*!< Select REF_F80M clock as the default clock choice */
} soc_periph_glitch_filter_clk_src_t;

////////////////////////////////////////////////ANA_CMPR////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of Analog Comparator
 */
#define SOC_ANA_CMPR_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST, SOC_MOD_CLK_REF_F80M}

/**
 * @brief Type of Analog Comparator clock source
 */
typedef enum {
    ANA_CMPR_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,         /*!< Select XTAL clock as the source clock */
    ANA_CMPR_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,   /*!< Select RC_FAST as the source clock */
    ANA_CMPR_CLK_SRC_REF_F80M = SOC_MOD_CLK_REF_F80M, /*!< Select REF_F80M as the source clock */
    ANA_CMPR_CLK_SRC_DEFAULT = SOC_MOD_CLK_REF_F80M,  /*!< Select REF_F80M as the default clock choice */
} soc_periph_ana_cmpr_clk_src_t;

//////////////////////////////////////////////////TWAI//////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of TWAI
 */
#define SOC_TWAI_CLKS {(soc_periph_twai_clk_src_t)SOC_MOD_CLK_XTAL, (soc_periph_twai_clk_src_t)SOC_MOD_CLK_REF_F80M}

/**
 * @brief TWAI clock source
 */
typedef enum {
    TWAI_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,         /*!< Select XTAL as the source clock */
    TWAI_CLK_SRC_REF_F80M = SOC_MOD_CLK_REF_F80M, /*!< Select REF_F80M as the source clock */
    TWAI_CLK_SRC_DEFAULT = SOC_MOD_CLK_REF_F80M,  /*!< Select REF_F80M as the default clock choice */
} soc_periph_twai_clk_src_t;

//////////////////////////////////////////////////MCPWM/////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of MCPWM Timer
 */
#define SOC_MCPWM_TIMER_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST, SOC_MOD_CLK_PLL_F160M}

/**
 * @brief Type of MCPWM timer clock source
 */
typedef enum {
    MCPWM_TIMER_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,             /*!< Select XTAL as the source clock */
    MCPWM_TIMER_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,       /*!< Select RC_FAST as the source clock */
    MCPWM_TIMER_CLK_SRC_PLL160M = SOC_MOD_CLK_PLL_F160M,     /*!< Select PLL_F160M as the source clock */
    MCPWM_TIMER_CLK_SRC_DEFAULT = SOC_MOD_CLK_PLL_F160M,     /*!< Select PLL_F160M as the default choice */
} soc_periph_mcpwm_timer_clk_src_t;

/**
 * @brief Array initializer for all supported clock sources of MCPWM Capture Timer
 */
#define SOC_MCPWM_CAPTURE_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST, SOC_MOD_CLK_PLL_F160M}

/**
 * @brief Type of MCPWM capture clock source
 */
typedef enum {
    MCPWM_CAPTURE_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,           /*!< Select XTAL as the source clock */
    MCPWM_CAPTURE_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,     /*!< Select RC_FAST as the source clock */
    MCPWM_CAPTURE_CLK_SRC_PLL160M = SOC_MOD_CLK_PLL_F160M,   /*!< Select PLL_F160M as the source clock */
    MCPWM_CAPTURE_CLK_SRC_DEFAULT = SOC_MOD_CLK_PLL_F160M,   /*!< Select PLL_F160M as the default choice */
} soc_periph_mcpwm_capture_clk_src_t;

/**
 * @brief Array initializer for all supported clock sources of MCPWM Carrier
 */
#define SOC_MCPWM_CARRIER_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST, SOC_MOD_CLK_PLL_F160M}

/**
 * @brief Type of MCPWM carrier clock source
 */
typedef enum {
    MCPWM_CARRIER_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,           /*!< Select XTAL as the source clock */
    MCPWM_CARRIER_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,     /*!< Select RC_FAST as the source clock */
    MCPWM_CARRIER_CLK_SRC_PLL160M = SOC_MOD_CLK_PLL_F160M,   /*!< Select PLL_F160M as the source clock */
    MCPWM_CARRIER_CLK_SRC_DEFAULT = SOC_MOD_CLK_PLL_F160M,   /*!< Select PLL_F160M as the default choice */
} soc_periph_mcpwm_carrier_clk_src_t;

//////////////////////////////////////////////////I2S/////////////////////////////////////////////////////////////////

/**
 * @brief I2S clock source
 */
#define SOC_I2S_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_APLL, SOC_MOD_CLK_RC_FAST, I2S_CLK_SRC_EXTERNAL}

/**
 * @brief I2S clock source enum
 * @note Enum values are matched with the register field values on purpose
 */
typedef enum {
    I2S_CLK_SRC_DEFAULT = SOC_MOD_CLK_XTAL,                            /*!< Auto select maximum clock source as default source clock */
    I2S_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,                /*!< Select XTAL as the source clock */
    I2S_CLK_SRC_APLL = SOC_MOD_CLK_APLL,                /*!< Select APLL as the source clock */
    I2S_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,        /*!< Select RC_FAST as the source clock */
    I2S_CLK_SRC_EXTERNAL = -1,                          /*!< Select external clock as source clock */
} soc_periph_i2s_clk_src_t;

//////////////////////////////////////////////////PARLIO////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of PARLIO
 */
#define SOC_PARLIO_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST, SOC_MOD_CLK_PLL_F160M}

/**
 * @brief PARLIO clock source
 */
typedef enum {
    PARLIO_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,           /*!< Select XTAL as the source clock */
    PARLIO_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,     /*!< Select RC_FAST as the source clock */
    PARLIO_CLK_SRC_PLL_F160M = SOC_MOD_CLK_PLL_F160M, /*!< Select PLL_F160M as the source clock */
    PARLIO_CLK_SRC_EXTERNAL = -1,                     /*!< Select EXTERNAL clock as the source clock */
    PARLIO_CLK_SRC_DEFAULT = SOC_MOD_CLK_PLL_F160M,   /*!< Select PLL_F160M as the default clock choice */
} soc_periph_parlio_clk_src_t;

//////////////////////////////////////////////CLOCK OUTPUT///////////////////////////////////////////////////////////
typedef enum {
    CLKOUT_SIG_MPLL_500M         = 0,   /*!< MPLL output at 500MHz */
    CLKOUT_SIG_BBPLL_480M        = 1,   /*!< BBPLL output at 480MHz */
    CLKOUT_SIG_CPLL_300M         = 2,   /*!< CPLL output at 300MHz */
    CLKOUT_SIG_XTAL_40M          = 3,   /*!< Main crystal clock at 40MHz */
    CLKOUT_SIG_FOSC_20M          = 4,   /*!< Fast RC oscillator ; nominally ~20MHz */
    CLKOUT_SIG_SOSC_600KD4       = 5,   /*!< Slow RC oscillator ; ~150kHz before RTC divider path, used for RTC slow timing */
    CLKOUT_SIG_RC_32K            = 6,   /*!< Internal ~32kHz RC oscillator output (low-precision; not recommended for applications) */
    CLKOUT_SIG_XTAL_32K          = 7,   /*!< External 32kHz crystal clock (XTAL32K on XTAL_32K_P/N) */
    CLKOUT_SIG_ANA_PLL_80M       = 8,   /*!< 80MHz analog PLL */
    CLKOUT_SIG_USB_OTGHS_PHYREF  = 9,   /*!< USB OTG HS PHY reference clock output for the high-speed PHY */
    CLKOUT_SIG_USB_OTGHS_ULPI    = 10,  /*!< USB OTG HS ULPI interface clock output */
    CLKOUT_SIG_MCPWM2            = 11,  /*!< MCPWM 2 module clock */
    CLKOUT_SIG_MCPWM3            = 12,  /*!< MCPWM 3 module clock */
    CLKOUT_SIG_CORE0_CLIC        = 13,  /*!< Core 0 clock */
    CLKOUT_SIG_CORE1_CLIC        = 14,  /*!< Core 1 clock */
    CLKOUT_SIG_AUDIO_PLL         = 15,  /*!< Audio PLL (APLL) output; frequency set via APLL configuration registers */
    CLKOUT_SIG_PAD_I2S0_MCLK     = 16,  /*!< I2S0 master clock */
    CLKOUT_SIG_PAD_I2S1_MCLK     = 17,  /*!< I2S1 master clock */
    CLKOUT_SIG_USB_DEVICE_INTPHY = 18,  /*!< Full-speed USB device internal PHY clock */
    CLKOUT_SIG_PAD_UART0_SLP     = 19,  /*!< UART0 sleep pad clock */
    CLKOUT_SIG_PAD_UART1_SLP     = 20,  /*!< UART1 sleep pad clock */
    CLKOUT_SIG_PAD_UART2_SLP     = 21,  /*!< UART2 sleep pad clock */
    CLKOUT_SIG_PAD_UART3_SLP     = 22,  /*!< UART3 sleep pad clock */
    CLKOUT_SIG_USB_DEVICE_48M    = 23,  /*!< USB device 48MHz functional clock output */
    CLKOUT_SIG_PAD_PARLIO_RX     = 24,  /*!< Parallel IO (PARLIO) RX clock */
    CLKOUT_SIG_PAD_PARLIO_TX     = 25,  /*!< Parallel IO (PARLIO) TX clock */
    CLKOUT_SIG_TCELL_CPU         = 26,  /*!< CPU domain clock */
    CLKOUT_SIG_TCELL_MEM         = 27,  /*!< memory subsystem clock */
    CLKOUT_SIG_TCELL_SYS         = 28,  /*!< system bus clock */
    CLKOUT_SIG_TCELL_APB         = 29,  /*!< APB peripheral bus clock */
    CLKOUT_SIG_FLASH_PLL         = 30,  /*!< MSPI flash PLL */
    CLKOUT_SIG_FLASH_CORE        = 31,  /*!< MSPI flash controller core clock */
    CLKOUT_SIG_PSRAM_PLL         = 32,  /*!< MSPI PSRAM PLL clock */
    CLKOUT_SIG_PSRAM_CORE        = 33,  /*!< MSPI PSRAM controller core clock */
    CLKOUT_SIG_ULPI_CLK_PAD_OUT  = 34,  /*!< ULPI clock forwarded to pad output */
    CLKOUT_SIG_SDIO_SLF          = 38,  /*!< SDIO slave  */
    CLKOUT_SIG_SDIO_DRV          = 39,  /*!< sdio_drv_clk_o */
    CLKOUT_SIG_SDIO_SAM          = 40,  /*!< sdio_sam_clk_o */
    CLKOUT_SIG_I2C0              = 44,  /*!< I2C0 peripheral module clock */
    CLKOUT_SIG_I2C1              = 45,  /*!< I2C1 peripheral module clock */
    CLKOUT_SIG_I2S0_RX           = 46,  /*!< I2S0 rx clock */
    CLKOUT_SIG_I2S0_TX           = 47,  /*!< I2S0 tx clock */
    CLKOUT_SIG_I2S1_RX           = 48,  /*!< I2S1 rx clock */
    CLKOUT_SIG_I2S1_TX           = 49,  /*!< I2S1 tx clock */
    CLKOUT_SIG_LCD               = 52,  /*!< LCD controller module clock */
    CLKOUT_SIG_UART0_SCLK        = 53,  /*!< UART0 source clock */
    CLKOUT_SIG_UART0_FCLK        = 54,  /*!< UART0 functional clock */
    CLKOUT_SIG_UART0_SLP         = 55,  /*!< UART0 sleep clock */
    CLKOUT_SIG_UART1_SCLK        = 56,  /*!< UART1 source clock */
    CLKOUT_SIG_UART1_FCLK        = 57,  /*!< UART1 functional clock */
    CLKOUT_SIG_UART1_SLP         = 58,  /*!< UART1 sleep clock */
    CLKOUT_SIG_UART2_SCLK        = 59,  /*!< UART2 source clock */
    CLKOUT_SIG_UART2_FCLK        = 60,  /*!< UART2 functional clock */
    CLKOUT_SIG_UART2_SLP         = 61,  /*!< UART2 sleep clock */
    CLKOUT_SIG_UART3_SCLK        = 62,  /*!< UART3 source clock */
    CLKOUT_SIG_UART3_FCLK        = 63,  /*!< UART3 functional clock */
    CLKOUT_SIG_UART3_SLP         = 64,  /*!< UART3 sleep clock */
    CLKOUT_SIG_CORDIC_CORE       = 65,  /*!< CORDIC accelerator core clock */
    CLKOUT_SIG_ZERO_DET_CORE     = 66,  /*!< Zero-cross / zero-detection peripheral core clock */
    CLKOUT_SIG_TWAI0             = 68,  /*!< TWAI0 module clock */
    CLKOUT_SIG_TWAI1             = 69,  /*!< TWAI1 module clock */
    CLKOUT_SIG_GPSPI2_HS         = 71,  /*!< SPI2 high-speed clock */
    CLKOUT_SIG_GPSPI2_MST        = 72,  /*!< SPI2 master functional clock */
    CLKOUT_SIG_GPSPI3_HS         = 73,  /*!< SPI3 high-speed clock */
    CLKOUT_SIG_GPSPI3_MST        = 74,  /*!< SPI3 master functional clock */
    CLKOUT_SIG_PARLIO_RX         = 75,  /*!< PARLIO RX clock */
    CLKOUT_SIG_PARLIO_TX         = 76,  /*!< PARLIO TX clock */
    CLKOUT_SIG_MCPWM0            = 78,  /*!< MCPWM0 module clock */
    CLKOUT_SIG_MCPWM1            = 79,  /*!< MCPWM1 module clock */
    CLKOUT_SIG_TIMERGRP0_T0      = 80,  /*!< Timer group 0, timer 0 module clock */
    CLKOUT_SIG_TIMERGRP0_T1      = 81,  /*!< Timer group 0, timer 1 module clock */
    CLKOUT_SIG_TIMERGRP0_WDT     = 82,  /*!< Timer group 0 watchdog module clock */
    CLKOUT_SIG_TIMERGRP1_T0      = 83,  /*!< Timer group 1, timer 0 module clock */
    CLKOUT_SIG_TIMERGRP1_T1      = 84,  /*!< Timer group 1, timer 1 module clock */
    CLKOUT_SIG_TIMERGRP1_WDT     = 85,  /*!< Timer group 1 watchdog module clock */
    CLKOUT_SIG_SYSTIMER          = 86,  /*!< System timer module clock */
    CLKOUT_SIG_LEDC0             = 87,  /*!< LED PWM controller instance 0 module clock */
    CLKOUT_SIG_RMT               = 88,  /*!< RMT peripheral module clock */
    CLKOUT_SIG_ADC               = 89,  /*!< ADC module clock */
    CLKOUT_SIG_ADC_SAR1          = 90,  /*!< SAR_ADC1 clock */
    CLKOUT_SIG_ADC_SAR2          = 91,  /*!< SAR_ADC2 clock */
    CLKOUT_SIG_ADC_SAR1_GCLK     = 92,  /*!< SAR_ADC1 GCLK */
    CLKOUT_SIG_ADC_SAR2_GCLK     = 93,  /*!< SAR_ADC2 GCLK */
    CLKOUT_SIG_PVT               = 94,  /*!< PVT module clock */
    CLKOUT_SIG_PVT_PERI_GROUP1   = 95,  /*!< PVT peripheral group 1 clock */
    CLKOUT_SIG_CRYPTO_SEC        = 96,  /*!< Security / crypto accelerator module clock */
    CLKOUT_SIG_LEDC1             = 97,  /*!< LED PWM controller instance 1 module clock */
    CLKOUT_SIG_IOMUX             = 98,  /*!< IO MUX clock */
    CLKOUT_SIG_REF_50M           = 99,  /*!< 50MHz reference clock */
    CLKOUT_SIG_REF_120M          = 100, /*!< 120MHz reference clock */
    CLKOUT_SIG_REF_160M          = 101, /*!< 160MHz reference clock */
    CLKOUT_SIG_REF_20M           = 102, /*!< 20MHz reference clock */
    CLKOUT_SIG_REF_240M          = 103, /*!< 240MHz reference clock */
    CLKOUT_SIG_REF_25M           = 104, /*!< 25MHz reference clock */
    CLKOUT_SIG_REF_80M           = 105, /*!< 80MHz reference clock */
    CLKOUT_SIG_REF_60M           = 106, /*!< 60MHz reference clock */
    /* Short / legacy aliases (identical mux index as the primary names above) */
    CLKOUT_SIG_MPLL              = CLKOUT_SIG_MPLL_500M,       /*!< Legacy short name; same mux as CLKOUT_SIG_MPLL_500M */
    CLKOUT_SIG_BBPLL             = CLKOUT_SIG_BBPLL_480M,      /*!< Legacy short name; same mux as CLKOUT_SIG_BBPLL_480M */
    CLKOUT_SIG_CPLL              = CLKOUT_SIG_CPLL_300M,       /*!< Legacy short name; same mux as CLKOUT_SIG_CPLL_300M */
    CLKOUT_SIG_XTAL              = CLKOUT_SIG_XTAL_40M,        /*!< Legacy short name; same mux as CLKOUT_SIG_XTAL_40M */
    CLKOUT_SIG_RC_FAST           = CLKOUT_SIG_FOSC_20M,        /*!< Legacy name for RC_FAST / FOSC domain; same mux as CLKOUT_SIG_FOSC_20M */
    CLKOUT_SIG_RC_SLOW           = CLKOUT_SIG_SOSC_600KD4,     /*!< Legacy name for RC_SLOW / SOSC domain; same mux as CLKOUT_SIG_SOSC_600KD4 */
    CLKOUT_SIG_XTAL32K           = CLKOUT_SIG_XTAL_32K,        /*!< Legacy short name; same mux as CLKOUT_SIG_XTAL_32K */
    CLKOUT_SIG_I2S0              = CLKOUT_SIG_PAD_I2S0_MCLK,   /*!< Legacy short name; same mux as CLKOUT_SIG_PAD_I2S0_MCLK */
    CLKOUT_SIG_I2S1              = CLKOUT_SIG_PAD_I2S1_MCLK,    /*!< Legacy short name; same mux as CLKOUT_SIG_PAD_I2S1_MCLK */
    CLKOUT_SIG_CPU               = CLKOUT_SIG_TCELL_CPU,       /*!< Legacy short name; same mux as CLKOUT_SIG_TCELL_CPU */
    CLKOUT_SIG_MEM               = CLKOUT_SIG_TCELL_MEM,       /*!< Legacy short name; same mux as CLKOUT_SIG_TCELL_MEM */
    CLKOUT_SIG_SYS               = CLKOUT_SIG_TCELL_SYS,       /*!< Legacy short name; same mux as CLKOUT_SIG_TCELL_SYS */
    CLKOUT_SIG_APB               = CLKOUT_SIG_TCELL_APB,       /*!< Legacy short name; same mux as CLKOUT_SIG_TCELL_APB */
    CLKOUT_SIG_PLL_F80M          = CLKOUT_SIG_REF_80M,         /*!< Legacy name; same mux as CLKOUT_SIG_REF_80M (80MHz reference tap) */
    CLKOUT_SIG_INVALID           = 0xFF,                       /*!< Invalid mux value; channel disabled or not connected */
} soc_clkout_sig_id_t;

