espressif/esp-idf/components/soc/esp32s31/include/soc/clk_tree_defs.h
//////////////////////////////////////CLOCK FREQUENCY CALCULATION////////////////////////////////////////////////////
/**
 * @brief Clock frequency calculation source selection
 */
typedef enum {
    CLK_CAL_RTC_SLOW = -1,                           /*!< Select to calculate frequency of RTC_SLOW_CLK */
    CLK_CAL_MPLL,                                    /*!< Select to calculate frequency of MPLL_CLK */
    CLK_CAL_BBPLL,                                   /*!< Select to calculate frequency of BBPLL_CLK */
    CLK_CAL_CPLL,                                    /*!< Select to calculate frequency of CPLL_CLK */
    CLK_CAL_APLL,                                    /*!< Select to calculate frequency of APLL_CLK */
    CLK_CAL_AHB,                                     /*!< Select to calculate frequency of AHB_CLK */
    CLK_CAL_APB,                                     /*!< Select to calculate frequency of APB_CLK */
    CLK_CAL_ROM,                                     /*!< Select to calculate frequency of ROM_CLK */
    CLK_CAL_RC_FAST,                                 /*!< Select to calculate frequency of RC_FAST_CLK */
    CLK_CAL_RC_SLOW,                                 /*!< Select to calculate frequency of RC_SLOW_CLK */
    CLK_CAL_32K_XTAL,                                /*!< Select to calculate frequency of XTAL32K_CLK */
    CLK_CAL_XTAL,                                    /*!< Select to calculate frequency of XTAL_CLK */
    CLK_CAL_UART0_PAD,                               /*!< Select to calculate frequency of UART0_PAD_CLK */
    CLK_CAL_CORE0,                                   /*!< Select to calculate frequency of CORE0_CLK */
    CLK_CAL_CORE1,                                   /*!< Select to calculate frequency of CORE1_CLK */
} soc_clk_freq_calculation_src_t;

//////////////////////////////////////////////////CORDIC///////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of CORDIC
 */
#define SOC_CORDIC_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST, SOC_MOD_CLK_PLL_F160M}

typedef enum {
    CORDIC_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,
    CORDIC_CLK_SRC_PLL_F160M = SOC_MOD_CLK_PLL_F160M,
    CORDIC_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,
    CORDIC_CLK_SRC_DEFAULT = SOC_MOD_CLK_PLL_F160M,
} soc_periph_cordic_clk_src_t;

//////////////////////////////////////////////////PCNT//////////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of PCNT
 */
#define SOC_PCNT_CLKS {SOC_MOD_CLK_APB}

/**
 * @brief Type of PCNT clock source
 */
typedef enum {
    PCNT_CLK_SRC_APB = SOC_MOD_CLK_APB,           /*!< Select APB as the source clock */
    PCNT_CLK_SRC_DEFAULT = SOC_MOD_CLK_APB,       /*!< Select APB as the default choice */
} soc_periph_pcnt_clk_src_t;

//////////////////////////////////////////////////ADC///////////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of ADC
 */
#define SOC_ADC_DIGI_CLKS {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_RC_FAST}

typedef enum {
    ADC_DIGI_CLK_SRC_RC_FAST = SOC_MOD_CLK_RC_FAST,   /*!< Select FOSC (internal RC oscillator) as ADC source clock */
    ADC_DIGI_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,         /*!< Select XTAL as ADC source clock */
    ADC_DIGI_CLK_SRC_DEFAULT = SOC_MOD_CLK_XTAL,       /*!< Select XTAL as the default clock choice */
} soc_periph_adc_digi_clk_src_t;

//////////////////////////////////////////////////Temp Sensor///////////////////////////////////////////////////////////

/**
 * @brief Array initializer for all supported clock sources of Temperature Sensor
 */
#define SOC_TEMP_SENSOR_CLKS {SOC_MOD_CLK_LP_PERI}

/**
* @brief Type of Temp Sensor clock source
*/
typedef enum {
    TEMPERATURE_SENSOR_CLK_SRC_LP_PERI = SOC_MOD_CLK_LP_PERI,     /*!< Select LP_PERI as the source clock */
    TEMPERATURE_SENSOR_CLK_SRC_DEFAULT = SOC_MOD_CLK_LP_PERI,    /*!< Select LP_PERI as the default choice */
} soc_periph_temperature_sensor_clk_src_t;

//////////////////////////////////////////////////EMAC///////////////////////////////////////////////////////////////
/**
 * @brief Array initializer for all supported clock sources of EMAC clock output
 */
#define SOC_EMAC_OUT_CLK {SOC_MOD_CLK_MPLL, SOC_MOD_CLK_CPLL, SOC_MOD_CLK_APLL}

typedef enum {
    EMAC_CLK_OUT_SRC_MPLL = SOC_MOD_CLK_MPLL,
    EMAC_CLK_OUT_SRC_CPLL = SOC_MOD_CLK_CPLL,
    EMAC_CLK_OUT_SRC_APLL = SOC_MOD_CLK_APLL,
    EMAC_CLK_OUT_SRC_DEFAULT = SOC_MOD_CLK_MPLL,
} soc_periph_emac_clk_out_src_t;

/**
 * @brief Array initializer for all supported clock sources of EMAC REF_PHY clock output
 */
#define SOC_EMAC_REF_PHY_CLK {SOC_MOD_CLK_MPLL, SOC_MOD_CLK_CPLL}

typedef enum {
    EMAC_REF_PHY_CLK_SRC_MPLL = SOC_MOD_CLK_MPLL,
    EMAC_REF_PHY_CLK_SRC_CPLL = SOC_MOD_CLK_CPLL,
    EMAC_REF_PHY_CLK_SRC_DEFAULT = SOC_MOD_CLK_MPLL,
} soc_periph_emac_ref_phy_clk_src_t;

/**
 * @brief Array initializer for all supported clock sources of EMAC PTP
 */
#define SOC_EMAC_PTP_CLK {SOC_MOD_CLK_XTAL, SOC_MOD_CLK_REF_F80M}

typedef enum {
    EMAC_PTP_CLK_SRC_XTAL = SOC_MOD_CLK_XTAL,
    EMAC_PTP_CLK_SRC_REF_F80M = SOC_MOD_CLK_REF_F80M,
    EMAC_PTP_CLK_SRC_DEFAULT = SOC_MOD_CLK_XTAL,
} soc_periph_emac_ptp_clk_src_t;

#ifdef __cplusplus
}
#endif
